// Задача 41: Пользователь вводит с клавиатуры M чисел. 
// Посчитайте, сколько чисел больше 0 ввёл пользователь.
// 0, 7, 8, -2, -2 -> 2
// 1, -7, 567, 89, 223-> 3
int Prompt(string);
Console.Write("Введите число: ");
srting value = Console.readLine();
int result = Convert.ToInt32(value);
return result;